MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6012/mcu.h
extern volatile C2RXF0EIDLBITS C2RXF0EIDLbits __attribute__((__sfr__));

#define C2RXF1SID C2RXF1SID
extern volatile uint16_t C2RXF1SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF1SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF1SIDBITS;
extern volatile C2RXF1SIDBITS C2RXF1SIDbits __attribute__((__sfr__));

#define C2RXF1EIDH C2RXF1EIDH
extern volatile uint16_t C2RXF1EIDH __attribute__((__sfr__));
typedef struct tagC2RXF1EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF1EIDHBITS;
extern volatile C2RXF1EIDHBITS C2RXF1EIDHbits __attribute__((__sfr__));

#define C2RXF1EIDL C2RXF1EIDL
extern volatile uint16_t C2RXF1EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF1EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF1EIDLBITS;
extern volatile C2RXF1EIDLBITS C2RXF1EIDLbits __attribute__((__sfr__));

#define C2RXF2SID C2RXF2SID
extern volatile uint16_t C2RXF2SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF2SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF2SIDBITS;
extern volatile C2RXF2SIDBITS C2RXF2SIDbits __attribute__((__sfr__));

#define C2RXF2EIDH C2RXF2EIDH
extern volatile uint16_t C2RXF2EIDH __attribute__((__sfr__));
typedef struct tagC2RXF2EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF2EIDHBITS;
extern volatile C2RXF2EIDHBITS C2RXF2EIDHbits __attribute__((__sfr__));

#define C2RXF2EIDL C2RXF2EIDL
extern volatile uint16_t C2RXF2EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF2EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF2EIDLBITS;
extern volatile C2RXF2EIDLBITS C2RXF2EIDLbits __attribute__((__sfr__));

#define C2RXF3SID C2RXF3SID
extern volatile uint16_t C2RXF3SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF3SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF3SIDBITS;
extern volatile C2RXF3SIDBITS C2RXF3SIDbits __attribute__((__sfr__));

#define C2RXF3EIDH C2RXF3EIDH
extern volatile uint16_t C2RXF3EIDH __attribute__((__sfr__));
typedef struct tagC2RXF3EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF3EIDHBITS;
extern volatile C2RXF3EIDHBITS C2RXF3EIDHbits __attribute__((__sfr__));

#define C2RXF3EIDL C2RXF3EIDL
extern volatile uint16_t C2RXF3EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF3EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF3EIDLBITS;
extern volatile C2RXF3EIDLBITS C2RXF3EIDLbits __attribute__((__sfr__));

#define C2RXF4SID C2RXF4SID
extern volatile uint16_t C2RXF4SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF4SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF4SIDBITS;
extern volatile C2RXF4SIDBITS C2RXF4SIDbits __attribute__((__sfr__));

#define C2RXF4EIDH C2RXF4EIDH
extern volatile uint16_t C2RXF4EIDH __attribute__((__sfr__));
typedef struct tagC2RXF4EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF4EIDHBITS;
extern volatile C2RXF4EIDHBITS C2RXF4EIDHbits __attribute__((__sfr__));

#define C2RXF4EIDL C2RXF4EIDL
extern volatile uint16_t C2RXF4EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF4EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF4EIDLBITS;
extern volatile C2RXF4EIDLBITS C2RXF4EIDLbits __attribute__((__sfr__));

#define C2RXF5SID C2RXF5SID
extern volatile uint16_t C2RXF5SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF5SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF5SIDBITS;
extern volatile C2RXF5SIDBITS C2RXF5SIDbits __attribute__((__sfr__));

#define C2RXF5EIDH C2RXF5EIDH
extern volatile uint16_t C2RXF5EIDH __attribute__((__sfr__));
typedef struct tagC2RXF5EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF5EIDHBITS;
extern volatile C2RXF5EIDHBITS C2RXF5EIDHbits __attribute__((__sfr__));

#define C2RXF5EIDL C2RXF5EIDL
extern volatile uint16_t C2RXF5EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF5EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF5EIDLBITS;
