MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6012/mcu.h
#define _C2CFG2_PRSEG0_POSITION                  0x00000000
#define _C2CFG2_PRSEG0_MASK                      0x00000001
#define _C2CFG2_PRSEG0_LENGTH                    0x00000001

#define _C2CFG2_PRSEG1_POSITION                  0x00000001
#define _C2CFG2_PRSEG1_MASK                      0x00000002
#define _C2CFG2_PRSEG1_LENGTH                    0x00000001

#define _C2CFG2_PRSEG2_POSITION                  0x00000002
#define _C2CFG2_PRSEG2_MASK                      0x00000004
#define _C2CFG2_PRSEG2_LENGTH                    0x00000001

#define _C2CFG2_SEG1PH0_POSITION                 0x00000003
#define _C2CFG2_SEG1PH0_MASK                     0x00000008
#define _C2CFG2_SEG1PH0_LENGTH                   0x00000001

#define _C2CFG2_SEG1PH1_POSITION                 0x00000004
#define _C2CFG2_SEG1PH1_MASK                     0x00000010
#define _C2CFG2_SEG1PH1_LENGTH                   0x00000001

#define _C2CFG2_SEG1PH2_POSITION                 0x00000005
#define _C2CFG2_SEG1PH2_MASK                     0x00000020
#define _C2CFG2_SEG1PH2_LENGTH                   0x00000001

#define _C2CFG2_SEG2PH0_POSITION                 0x00000008
#define _C2CFG2_SEG2PH0_MASK                     0x00000100
#define _C2CFG2_SEG2PH0_LENGTH                   0x00000001

#define _C2CFG2_SEG2PH1_POSITION                 0x00000009
#define _C2CFG2_SEG2PH1_MASK                     0x00000200
#define _C2CFG2_SEG2PH1_LENGTH                   0x00000001

#define _C2CFG2_SEG2PH2_POSITION                 0x0000000A
#define _C2CFG2_SEG2PH2_MASK                     0x00000400
#define _C2CFG2_SEG2PH2_LENGTH                   0x00000001

#define _C2INTF_RXB0IF_POSITION                  0x00000000
#define _C2INTF_RXB0IF_MASK                      0x00000001
#define _C2INTF_RXB0IF_LENGTH                    0x00000001

#define _C2INTF_RXB1IF_POSITION                  0x00000001
#define _C2INTF_RXB1IF_MASK                      0x00000002
#define _C2INTF_RXB1IF_LENGTH                    0x00000001

#define _C2INTF_TXB0IF_POSITION                  0x00000002
#define _C2INTF_TXB0IF_MASK                      0x00000004
#define _C2INTF_TXB0IF_LENGTH                    0x00000001

#define _C2INTF_TXB1IF_POSITION                  0x00000003
#define _C2INTF_TXB1IF_MASK                      0x00000008
#define _C2INTF_TXB1IF_LENGTH                    0x00000001

#define _C2INTF_TXB2IF_POSITION                  0x00000004
#define _C2INTF_TXB2IF_MASK                      0x00000010
#define _C2INTF_TXB2IF_LENGTH                    0x00000001

#define _C2INTF_ERRIF_POSITION                   0x00000005
#define _C2INTF_ERRIF_MASK                       0x00000020
#define _C2INTF_ERRIF_LENGTH                     0x00000001

#define _C2INTF_WAKIF_POSITION                   0x00000006
#define _C2INTF_WAKIF_MASK                       0x00000040
#define _C2INTF_WAKIF_LENGTH                     0x00000001

#define _C2INTF_IRXIF_POSITION                   0x00000007
#define _C2INTF_IRXIF_MASK                       0x00000080
#define _C2INTF_IRXIF_LENGTH                     0x00000001

#define _C2INTF_EWARN_POSITION                   0x00000008
#define _C2INTF_EWARN_MASK                       0x00000100
#define _C2INTF_EWARN_LENGTH                     0x00000001

#define _C2INTF_RXWARN_POSITION                  0x00000009
#define _C2INTF_RXWARN_MASK                      0x00000200
#define _C2INTF_RXWARN_LENGTH                    0x00000001

#define _C2INTF_TXWARN_POSITION                  0x0000000A
#define _C2INTF_TXWARN_MASK                      0x00000400
#define _C2INTF_TXWARN_LENGTH                    0x00000001

#define _C2INTF_RXBP_POSITION                    0x0000000B
#define _C2INTF_RXBP_MASK                        0x00000800
#define _C2INTF_RXBP_LENGTH                      0x00000001

#define _C2INTF_TXBP_POSITION                    0x0000000C
#define _C2INTF_TXBP_MASK                        0x00001000
#define _C2INTF_TXBP_LENGTH                      0x00000001

#define _C2INTF_TXBO_POSITION                    0x0000000D
#define _C2INTF_TXBO_MASK                        0x00002000
#define _C2INTF_TXBO_LENGTH                      0x00000001

#define _C2INTF_RXB1OVFL_POSITION                0x0000000E
#define _C2INTF_RXB1OVFL_MASK                    0x00004000
#define _C2INTF_RXB1OVFL_LENGTH                  0x00000001

#define _C2INTF_RXB0OVFL_POSITION                0x0000000F
#define _C2INTF_RXB0OVFL_MASK                    0x00008000
#define _C2INTF_RXB0OVFL_LENGTH                  0x00000001

#define _C2INTF_RX0IF_POSITION                   0x00000000
#define _C2INTF_RX0IF_MASK                       0x00000001
#define _C2INTF_RX0IF_LENGTH                     0x00000001

#define _C2INTF_RX1IF_POSITION                   0x00000001
#define _C2INTF_RX1IF_MASK                       0x00000002
#define _C2INTF_RX1IF_LENGTH                     0x00000001

#define _C2INTF_TX0IF_POSITION                   0x00000002
#define _C2INTF_TX0IF_MASK                       0x00000004
#define _C2INTF_TX0IF_LENGTH                     0x00000001

#define _C2INTF_TX1IF_POSITION                   0x00000003
#define _C2INTF_TX1IF_MASK                       0x00000008
#define _C2INTF_TX1IF_LENGTH                     0x00000001

#define _C2INTF_TX2IF_POSITION                   0x00000004
#define _C2INTF_TX2IF_MASK                       0x00000010
#define _C2INTF_TX2IF_LENGTH                     0x00000001

#define _C2INTF_IVRIF_POSITION                   0x00000007
#define _C2INTF_IVRIF_MASK                       0x00000080
#define _C2INTF_IVRIF_LENGTH                     0x00000001

#define _C2INTF_RXWAR_POSITION                   0x00000009
#define _C2INTF_RXWAR_MASK                       0x00000200
#define _C2INTF_RXWAR_LENGTH                     0x00000001

#define _C2INTF_TXWAR_POSITION                   0x0000000A
#define _C2INTF_TXWAR_MASK                       0x00000400
#define _C2INTF_TXWAR_LENGTH                     0x00000001

#define _C2INTF_RXEP_POSITION                    0x0000000B
#define _C2INTF_RXEP_MASK                        0x00000800
#define _C2INTF_RXEP_LENGTH                      0x00000001

